task_separation.org
* TASK SEPARATION
To be able to understand the app thoroughly, I find important that both contributors work
on all the topics at hand, some of which are:
- Persistence through DAO.
- Swing (Creation of windows).
- Component creation.
** Enrique Kessler Martínez
- Improvement of Login window.
- Creation of searching songs window.
- Creation of Recent songs window.
X Initial persistence configuration.
- Controller configuration.
- Repo Creation for Songs (SongsRepo)
- DAO Adapter for Song.
- Tests for Song functionality.
- Component creation.
** Javier Barceló Pérez
- Improvement of Register window.
- Creation of Main window.
- Creation of NewList window.
- Creation of MyLists window.
- Creation of Most reproduced songs window.
- Repo creation for Users (UsersRepo): En español lo llama el profesor Catálogo.
- DAO Adapter for User.
- Tests for User functionality.

