task_separation.tex
% Created 2020-11-19 jue 08:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Enrique Kessler Martínez}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Enrique Kessler Martínez},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1.50 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{TASK SEPARATION}
\label{sec:org10ac16d}
To be able to understand the app thoroughly, I find important that both contributors work
on all the topics at hand, some of which are:
\begin{itemize}
\item Persistence through DAO.
\item Swing (Creation of windows).
\item Component creation.
\end{itemize}
\subsection{Enrique Kessler Martínez}
\label{sec:org2e22166}
\begin{itemize}
\item Improvement of Login window.
\item Creation of searching songs window.
\item Creation of Recent songs window.
\item Initial persistence configuration.
\item Controller configuration.
\item Repo Creation for Songs (SongsRepo)
\item DAO Adapter for Song.
\item Tests for Song functionality.
\item Component creation.
\end{itemize}
\subsection{Javier Barceló Pérez}
\label{sec:org3251598}
\begin{itemize}
\item Improvement of Register window.
\item Creation of Main window.
\item Creation of NewList window.
\item Creation of MyLists window.
\item Creation of Most reproduced songs window.
\item Repo creation for Users (UsersRepo): En español lo llama el profesor Catálogo.
\item DAO Adapter for User.
\item Tests for User functionality.
\end{itemize}
\end{document}
